app/views/user_books/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user_id, 'Select User' %>
    <%= form.collection_select :user_id, User.all, :id, :username, prompt: 'Choose a user' %>

SELECT "books".* FROM "books"
---
    <%= form.label :book_id, 'Select Book' %>
    <%= form.collection_select :book_id, Book.all, :id, :title, prompt: 'Choose a book' %>