app/controllers/books_controller.rb

  def confirm_delete
    @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at", "author", "price", "published_date") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "The Titan's Curse"], ["created_at", "2023-09-05 09:19:40.997015"], ["updated_at", "2023-09-05 09:19:40.997015"], ["author", nil], ["price", nil], ["published_date", nil]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = $1, "author" = $2, "price" = $3, "published_date" = $4 WHERE "books"."id" = $5  [["updated_at", "2023-09-05 08:51:37.492123"], ["author", "Rick Riordan"], ["price", "20.0"], ["published_date", "2005-07-01"], ["id", 4]]