app/controllers/user_books_controller.rb

INSERT INTO "user_books" ("user_id", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["book_id", 4], ["created_at", "2023-09-12 21:40:59.815658"], ["updated_at", "2023-09-12 21:40:59.815658"]]
---
  def create
    @user_book = UserBook.new(user_book_params)

    respond_to do |format|
      if @user_book.save

SELECT "user_books".* FROM "user_books" WHERE "user_books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_user_book
      @user_book = UserBook.find(params[:id])